results/ASPLOS/WILDFIRE/YCSB-ROCKSDB-CORUN-200sec/50M-KEYS/8/batchsize-256/ycsbwkldf/CII.out
Setting g_min_fd 3 
Setting g_min_fd 3 
RocksDB:    version 5.4
Date:       Sun Mar  3 22:14:57 2024
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    50000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    196266.2 MB (estimated)
FileSize:   98609.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA]
ycsbwkldf    :      20.154 micros/op 49617 ops/sec; ( reads:627187 writes:624812 total:50000000 found:627187)
	Command being timed: "/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/db_bench --db=/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA --num_levels=6 --key_size=20 --prefix_size=20 --memtablerep=prefix_hash --bloom_bits=10 --bloom_locality=1 --use_existing_db=1 --num=50000000 --duration=200 --compression_type=none --value_size=4096 --threads=8 --benchmarks=ycsbwkldf --use_existing_db=1 --mmap_read=0 --threads=8"
	User time (seconds): 204.94
	System time (seconds): 217.97
	Percent of CPU this job got: 206%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 3:24.32
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 1992008
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 70
	Minor (reclaiming a frame) page faults: 7814074
	Voluntary context switches: 6846206
	Involuntary context switches: 1907
	Swaps: 0
	File system inputs: 58965072
	File system outputs: 265427416
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0
[86231.897627] sh (261108): drop_caches: 3
[86231.957987] sh (261115): drop_caches: 3
[86266.166787] write_proc_unbounded: Value of write = 1
[86266.166798] write_proc_2mb_limit: Value of write = 1
[86266.166802] write_proc_bitmap_shift: Value of write = 38
[86266.173465] write_proc_unbounded: Value of write = 1
[86266.173476] write_proc_2mb_limit: Value of write = 1
[86266.173480] write_proc_bitmap_shift: Value of write = 38
[86266.971698] write_proc_unbounded: Value of write = 0
[86266.971713] write_proc_2mb_limit: Value of write = 0
[86266.972002] write_proc_unbounded: Value of write = 0
[86266.972019] write_proc_2mb_limit: Value of write = 0
[86266.972308] write_proc_unbounded: Value of write = 0
[86266.972318] write_proc_2mb_limit: Value of write = 0
[86266.972477] write_proc_unbounded: Value of write = 0
[86266.972484] write_proc_2mb_limit: Value of write = 0
[86266.972544] write_proc_unbounded: Value of write = 0
[86266.972555] write_proc_2mb_limit: Value of write = 0
[86266.972707] write_proc_unbounded: Value of write = 0
[86266.972713] write_proc_2mb_limit: Value of write = 0
[86266.972860] write_proc_unbounded: Value of write = 0
[86266.972870] write_proc_2mb_limit: Value of write = 0
[86266.973058] write_proc_unbounded: Value of write = 0
[86266.973064] write_proc_2mb_limit: Value of write = 0
[86266.973135] write_proc_unbounded: Value of write = 0
[86266.973140] write_proc_2mb_limit: Value of write = 0
[86266.973390] write_proc_unbounded: Value of write = 0
[86266.973398] write_proc_2mb_limit: Value of write = 0
[86266.974405] write_proc_unbounded: Value of write = 0
[86266.974412] write_proc_2mb_limit: Value of write = 0
[86266.978029] write_proc_unbounded: Value of write = 0
[86266.978038] write_proc_2mb_limit: Value of write = 0
[86266.978059] write_proc_unbounded: Value of write = 0
[86266.978064] write_proc_2mb_limit: Value of write = 0
[86266.978268] write_proc_unbounded: Value of write = 0
[86266.978285] write_proc_2mb_limit: Value of write = 0
[86266.978307] write_proc_unbounded: Value of write = 0
[86266.978319] write_proc_2mb_limit: Value of write = 0
[86266.978319] write_proc_unbounded: Value of write = 0
[86266.978331] write_proc_2mb_limit: Value of write = 0
[86266.978346] write_proc_unbounded: Value of write = 0
[86266.978350] write_proc_unbounded: Value of write = 0
[86266.978358] write_proc_2mb_limit: Value of write = 0
[86266.978359] write_proc_2mb_limit: Value of write = 0
[86266.978927] write_proc_unbounded: Value of write = 0
[86266.978933] write_proc_2mb_limit: Value of write = 0
[86266.978973] write_proc_unbounded: Value of write = 0
[86266.978978] write_proc_2mb_limit: Value of write = 0
[86266.980152] write_proc_unbounded: Value of write = 0
[86266.980157] write_proc_2mb_limit: Value of write = 0
[86266.983557] write_proc_unbounded: Value of write = 0
[86266.983562] write_proc_2mb_limit: Value of write = 0
[86266.990325] write_proc_unbounded: Value of write = 0
[86266.990338] write_proc_2mb_limit: Value of write = 0
[86266.990946] write_proc_unbounded: Value of write = 0
[86266.990956] write_proc_2mb_limit: Value of write = 0
[86266.992559] write_proc_unbounded: Value of write = 0
[86266.992563] write_proc_2mb_limit: Value of write = 0
[86266.992662] write_proc_unbounded: Value of write = 0
[86266.992666] write_proc_2mb_limit: Value of write = 0
[86266.992768] write_proc_unbounded: Value of write = 0
[86266.992775] write_proc_2mb_limit: Value of write = 0
[86266.995222] write_proc_unbounded: Value of write = 0
[86266.995228] write_proc_2mb_limit: Value of write = 0
[86266.997410] write_proc_unbounded: Value of write = 0
[86266.997417] write_proc_2mb_limit: Value of write = 0
[86266.998144] write_proc_unbounded: Value of write = 0
[86266.998151] write_proc_2mb_limit: Value of write = 0
[86266.998282] write_proc_unbounded: Value of write = 0
[86266.998292] write_proc_2mb_limit: Value of write = 0
[86266.998338] write_proc_unbounded: Value of write = 0
[86266.998345] write_proc_2mb_limit: Value of write = 0
[86470.434623] write_proc_unbounded: Value of write = 0
[86470.434638] write_proc_2mb_limit: Value of write = 0
[86470.492289] write_proc_unbounded: Value of write = 0
[86470.492297] write_proc_2mb_limit: Value of write = 0